      *>---------------------------------------------------------------*
      *> Copy padrão de Select para arquivos de dados                  *
      *>---------------------------------------------------------------*
           SELECT XARQARQ         ASSIGN TO XNOM
                                  ORGANIZATION IS INDEXED
                                  ACCESS MODE IS DYNAMIC
                                  RECORD KEY IS XKEY
                                  FILE STATUS IS XFSARQ.
      *>---------------------------------------------------------------*
       